response = {}

response["server_error"] = "[❌] Ошибка сервера"

response["gender"] = (
    "Приветствую! Давай заполним твою анкету, чтобы подобрать тебе подходящего коллегу. " "Начнем с простого: 🧑/👩?"
)

response["name"] = "Напиши своё настоящее имя и фамилию"

response["age"] = "Будем знакомы {}! Для общего понимания напиши свой возраст"

response["status"] = "Выбери статус который тебе ближе всего подходит"

response["area"] = (
    "Выбери с какой областью науки связана твоя тема "
    "(Если с несколькими из ниже перечисленных - перечисли через запятую)"
)

response["info"] = (
    "Теперь главное! Опиши в подробностях чем ты занимаешься, с какими трудностями столкнулся, "
    "промежутоные итоги. На основе этой информации в последствии будут подбираться похожие анкеты"
)

response["integration"] = "Для улучшения своей анкеты можешь привязать аккаунт:"

response["github"] = "Введите имя github вашего аккаунта"

response["gscholar"] = "Bведите имя google scholar ашего аккаунта"

response["repeat"] = "Аккаунт не найден! Повторите ввод"

response["permission"] = "{} \n\n<b>Всё верно?</b>"

response["restart"] = "Хорошо! Давай заполним твою анкету по новой. Начнем с простого: 🧑/👩?"

response["already_reg"] = "[✅] Вы уже создавали анкету! /menu"

response["login"] = "[✅] Вы успешно залогинились в систему! /menu"

response["new_name"] = "[⚙️] Напиши новое имя"

response["new_age"] = "[⚙️] Напиши новый возраст"

response["new_status"] = "[⚙️] Выбери новый статус"

response["new_area"] = (
    "[⚙️] Выбери новую научную область из нижеперечисленных." " (Можно перечислить несколько через запятую)"
)

response["new_info"] = (
    "[⚙️] Опиши в подробностях чем ты занимаешься."
    " Помни на основе этого в последствии будут подбираться похожии анкеты!"
)

response["not_found"] = "[❌] Похоже ваша анкета утеряна! Заполнить новую можно с помощью /start"

response["change"] = "[✅] Изменения внесены!"

response["searching_stop"] = "[❌] В данный момент нет доступных анкет"

response["clean"] = "[✅] История очищена!"

response["notification"] = "[⚡️] Пользователь отметил вашу анкету"

response["matched"] = "[⚡️] Matched! @{}"

response["matched_call"] = "[⚡️] Matched!"

response["no_matched"] = "[❌] В данный момент у вас нет коллег"
